package com.ivymei.system.common.constant.enums.ucenter.base;

public enum PushTypeEnum {

    /**
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     * 医生端
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     */

    医生端_预约挂号申请通过(
            "10001", "预约挂号申请通过", "您提交的线下预约申请已通过。出诊医馆：{0}，预约挂号费：{1}元。"),
    医生端_新预约(
            "10002", "新预约", "您有一新预约：订单号{0}，{1} {2}（{3}）,点此查看详情。"),
    医生端_预约取消(
            "10003", "预约取消", "您有一预约已取消：订单号{0}，{1} {2}（{3}）,点此查看详情。"),
    医生端_患者报到(
            "10004", "患者报到", "患者{0}已报到，请做好接诊准备。"),
    医生端_预约完成(
            "10005", "预约完成", "患者{0}已完成就诊，点此查看详情。"),
    医生端_药方审核完成(
            "10006", "药方审核完成", "您的药方订单已审核完成：订单号{0}，点此查看详情。"),
    医生端_药方支付(
            "10007", "药方支付", "您的药方订单已完成支付：订单号{0}，预计发货时间：{1}。点此查看详情。"),
    医生端_药方发货(
            "10008", "药方发货", "您的药方订单已发货：订单号{0}，预计到达时间：{1}，点此查看详情。"),
    医生端_药方收货(
            "10009", "药方收货", "您的药方订单已收货：订单号{0}，点此查看详情。"),
    医生端_药方退签(
            "10010", "药方退签", "您的药方订单已退签：订单号{0}，点此查看详情。"),
    医生端_系统通知(
            "10011", "系统通知", "系统发布一则新通知，点此查看详情。"),


    // TODO 没找到
    医生端_待入账新收益(
            "10012", "待入账新收益", "您有一笔{0}新收益待入账，点此查看详情。"),
    // TODO 没找到
    医生端_待入账新奖励(
            "10013", "待入账新奖励", "您有一笔新奖励收益[{0}]待入账，点此查看详情。"),


    医生端_已入账收益(
            "10014", "已入账收益", "您有一笔新收益已入账，点此查看详情。"),
    医生端_已入账奖励(
            "10015", "已入账奖励", "您有一笔新奖励收益[{0}]已入账，点此查看详情。"),

    医生端_提现成功(
            "10016", "提现成功", "您的提现申请已审核通过，请留意银行到账通知，点此查看详情。"),
    医生端_提现失败(
            "10017", "提现失败", "抱歉，您提交的提现申请经审核不通过，请检查提交的支行名称及卡号是否正确，点此查看详情。"),
    医生端_义诊新任务(
            "10018", "义诊新任务", "您有一个新的义诊订单可抢，3分钟后将分配给其他医生，福利多多，先到先得。"),
    医生端_新消息(
            "10019", "{0}发来一条新消息", "{1}"),
    医生端_义诊结束(
            "10020", "义诊结束", "您与{0}患者的{1}义诊服务已结束，稍后会发放义诊奖励，点此查看详情。"),
    医生端_图文咨询新任务(
            "10021", "图文咨询新任务", "{0}患者购买了您的{1}图文咨询服务，点此开始咨询。"),
    医生端_图文咨询结束(
            "10022", "图文咨询结束", "您与{0}患者的{1}图文咨询服务已结束，点此查看详情。"),
    医生端_电话咨询新任务(
            "10023", "电话咨询新任务", "{0}患者购买了您的{1}电话咨询服务，点此开始咨询。"),
    医生端_电话咨询进行中(
            "10024", "电话咨询进行中", "{0}患者正在拨打您的电话，请注意接听4006-915802电话，点此查看详情。"),
    医生端_电话咨询结束(
            "10025", "电话咨询结束", "您与{0}患者的{1}电话咨询服务已结束，点此查看详情。"),
    医生端_新评价(
            "10026", "新评价", "{0}患者已对您进行评价，点此查看详情。"),
    医生端_退款申请(
            "10027", "退款申请", "{0}患者发起退款申请，点此查看详情。"),
    医生端_退款通过(
            "10028", "退款通过", "{0}患者提交的退款申请已审核通过，点此查看详情。"),
    医生端_退款不通过(
            "10029", "退款不通过", "{0}患者提交的退款申请已审核不通过，点此查看详情。"),
    医生端_服务剩余1小时(
            "10030", "服务剩余1小时", "您与{0}患者的{1}{2}服务还有1小时将结束，点此继续咨询。"),
    医生端_新患者关注(
            "10031", "新患者关注", "{0}患者关注了您，点此查看详情。"),
    医生端_服务升级提醒(
            "10032", "服务升级提醒", "您与{0}患者的{1}义诊服务已升级为图文咨询服务，点此继续服务。"),
    医生端_资格认证成功(
            "10033", "资格认证成功", "亲爱的{0}医生，您已成为金华佗认证医生，立即去设置服务开始我们共同的旅程。"),
    医生端_资格认证失败(
            "10034", "资格认证失败", "亲爱的{0}医生，我们很抱歉的通知您，您提交的资格认证申请审核不通过，不通过原因如下：{1}。"),
    医生端_职称认证成功(
            "10035", "职称认证成功", "亲爱的{0}医生，您的职称：{1}，修改后的职称名：{2}，已修改成功。"),
    医生端_职称认证失败(
            "10036", "职称认证失败", "亲爱的{0}医生，我们很抱歉的通知您，您提交的职称认证申请审核不通过，不通过原因如下：{1}。"),


    /**
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     * 患者端
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     */
    患者端_药方完成开方(
            "10039", "药方完成开方", "{0}医生已为你开了药方，订单号{1}，点此查看详情。"),
    患者端_药方审核完成(
            "10040", "药方审核完成", "你药方订单已审核完成，订单号{0}，点此查看详情完成支付。"),
    患者端_药方发货(
            "10041", "药方发货", "你药方订单已发货，订单号{0}，预计到达时间：{1}，点此查看详情。"),
    患者端_药方退签(
            "10042", "药方退签", "你药方订单已退签，订单号{0}，点此查看详情。"),
    患者端_系统通知(
            "10043", "系统通知", "系统发布一则新通知，点此查看详情。"),
    患者端_义诊被接单(
            "10044", "义诊被接单", "您的义诊请求已由{0}医生接单，服务时间为24小时，请及时和医生进行咨询，点此开始聊天。"),
    患者端_新消息(
            "10045", "{0}医生发来一条新消息", "{1}"),
    患者端_义诊结束(
            "10046", "义诊结束", "您与{0}医生的{1}义诊服务已结束，点此对医生进行评价。"),
    患者端_图文咨询结束(
            "10047", "图文咨询结束", "您与{0}医生的{1}图文咨询服务已结束，点此对医生进行评价。"),
    患者端_电话咨询结束(
            "10048", "电话咨询结束", "您与{0}医生的{1}电话咨询服务已结束，点此对医生进行评价。"),
    患者端_新优惠券(
            "10049", "新优惠券", "您获得了一新优惠券，及时使用享受天降优惠，点此查看详情。"),
    患者端_优惠券过期提醒(
            "10050", "优惠券过期提醒", "您有一优惠券即将过期，点此查看详情。"),
    患者端_优惠券过期(
            "10051", "优惠券过期", "您有一优惠券已过期，点此查看详情。"),
    患者端_退款成功(
            "10052", "退款成功", "您提交的退款申请已审核通过，点此查看账户余额。"),
    患者端_退款失败(
            "10053", "退款失败", "抱歉，您提交的退款申请审核不通过，点此查看详情。"),
    患者端_会员卡升级(
            "10054", "会员卡升级", "您的会员卡由{0}升级为{1}，点此查看详情。"),
    患者端_服务剩余1小时(
            "10055", "服务剩余1小时", "您与{0}医生的{1}{2}还有1小时将结束，点此继续咨询。"),


    // TODO 没找到
    患者端_测评邀约(
            "10056", "测评邀约", "{0}医生向你发起了测评邀约，点此查看详情。"),
    // TODO 没找到
    患者端_讲座邀约(
            "10057", "讲座邀约", "{0}医生向你推荐了《{1}》中医讲座，点此查看详情。"),
    // TODO 没找到
    患者端_出诊时间邀约(
            "10058", "出诊时间邀约", "{0}医生向你发送了他的出诊时间，点此查看详情。"),
    // TODO 没找到
    患者端_复诊邀约(
            "10059", "复诊邀约", "{0}医生向你发起了复诊邀约，点此查看详情。"),

    患者端_报名讲座开讲提醒(
            "10060", "报名讲座开讲提醒", "您报名的{0}医生的讲座还有{1}分钟就要开始了，点此查看详情。"),


    /**
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     * 2.4 新增
     * - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - > - >
     */
    患者端_图文咨询新购买(
            "10061", "图文咨询新购买", "您购买了{0}医生的{1}图文咨询服务，点此开始咨询。"),
    患者端_充值成功(
            "10062", "充值成功", "尊敬的{0}，你已充值成功。"),
    医生端_义诊已接单(
            "10063", "您当前有一条义诊订单", "您当前有一条义诊订单需要处理，点击查看详情。")



    ;

    private String templateId;
    private String title;
    private String content;

    PushTypeEnum(String templateId, String title, String content) {
        this.templateId = templateId;
        this.title = title;
        this.content = content;
    }

    public String getTemplateId() {
        return templateId;
    }

    public void setTemplateId(String templateId) {
        this.templateId = templateId;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }

    public String getContent() {
        return content;
    }

    public void setContent(String content) {
        this.content = content;
    }

    public static PushTypeEnum getByTemplateId(Integer templateId) {
        if (templateId != null) {
            for (PushTypeEnum m : PushTypeEnum.values()) {
                if (m.getTemplateId().equals(templateId)) {
                    return m;
                }
            }
        }
        return null;
    }


}
